run_cases/case07_acousticWaveSquareCylinder/constant/linearZone/omegaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "constant/linearZone";
    object      omegaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
204160
(
7.681206909e-06
7.681206909e-06
7.552158144e-06
7.549913818e-06
7.425353706e-06
7.420865053e-06
7.300793594e-06
7.294060615e-06
...
)
;

boundaryField
{
    sides
    {
        type            calculated;
        value           uniform 0;
    }
    frontBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
