run_cases/case07_acousticWaveSquareCylinder/0.orig/nonLinearZone/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    /*top
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    bottom
    {
        type            outletInlet;
        outletValue     uniform (0 0 0);
        value           uniform (0 0 0);
    }*/
    
    "interface.*"
    {
    	type			mixed;
    	refValue		$internalField;
    	refGradient		uniform (0 0 0);
    	valueFraction	uniform 0;
    	value			$internalField;
    }

    cylinder
    {
        type            noSlip;
    }

    frontBack
    {
        type            empty;
    }
}
// ************************************************************************* //
