run_cases/case07_acousticWaveSquareCylinder/0.orig/nonLinearZone/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    /*"(top|bottom)"
    {
        type            waveTransmissive;
        psi             thermo:psi;
        gamma           1.40389876255;
        fieldInf        1e5;
        lInf            10;
        value           $internalField;
    }*/
    
    "interface.*"
    {
    	type			mixed;
    	refValue		$internalField;
    	refGradient		uniform 0;
    	valueFraction	uniform 0;
    	value			$internalField;
    }
	
    cylinder
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
