run_cases/case07_acousticWaveSquareCylinder/system/linearZone/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

WL	4;
HL	4;
L   0.75;

x0	#calc "-0.5*$WL";
x1	#calc " 0.5*$WL";

y0	#calc "-0.5*$HL";
y1	#calc " 0.5*$HL";

z0	-0.5;
z1	 0.5;

actions
(
    {
        name    spongeLayerR;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
		{
			box (#calc "($x1)-($L)" $y0 $z0)
				($x1                $y1 $z1);
		}
    }
    
    {
        name    spongeZoneR;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
		sourceInfo
		{
		   set	spongeLayerR;
		}
    }
    
    {
        name    spongeLayerL;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
		{
			box ($x0                $y0 $z0)
				(#calc "($x0)+($L)" $y1 $z1);
		}
    }
    
    {
        name    spongeZoneL;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
		sourceInfo
		{
		   set	spongeLayerL;
		}
    }
    
    {
        name    spongeLayerT;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
		{
			box ($x0 #calc "($y1)-($L)" $z0)
				($x1 $y1                $z1);
		}
    }
    
    {
        name    spongeZoneT;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
		sourceInfo
		{
		   set	spongeLayerT;
		}
    }
    
    {
        name    spongeLayerB;
        type    cellSet;
        action  new;
        source  boxToCell;
		sourceInfo
		{
			box ($x0 $y0                $z0)
				($x1 #calc "($y0)+($L)" $z1);
		}
    }
    
    {
        name    spongeZoneB;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
		sourceInfo
		{
		   set	spongeLayerB;
		}
    }
);

// ************************************************************************* //
